#======================================================================================
#=================================== RELATÓRIO ========================================
#======================================================================================

Problema:

Foi identificado que para cada vez que o loop rodava a variável a era inicializada.

Solução:

A inicialização foi retirada do loop, deixando apenas a parte de incrementar.

#======================================================================================
#===================================== SCRIPT =========================================
#======================================================================================

dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ script log/c15rela
torio.txt
Script started, output log file is 'log/c15relatorio.txt'.
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
./bin/c15
make: *** [Makefile:40: run] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make memtest SRC=s
rc/c15.c
valgrind --leak-check=full ./bin/c15
==5498== Memcheck, a memory error detector
==5498== Copyright (C) 2002-2022, and GNU GPL'd, by Julian Seward et al.
==5498== Using Valgrind-3.19.0 and LibVEX; rerun with -h for copyright info
==5498== Command: ./bin/c15
==5498== 
==5498== 
==5498== HEAP SUMMARY:
==5498==     in use at exit: 0 bytes in 0 blocks
==5498==   total heap usage: 0 allocs, 0 frees, 0 bytes allocated
==5498== 
==5498== All heap blocks were freed -- no leaks are possible
==5498== 
==5498== For lists of detected and suppressed errors, rerun with: -s
==5498== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)
make: *** [Makefile:43: memtest] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
./bin/c15
make: *** [Makefile:40: run] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
./bin/c15
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make SRC=src/c15.c
make: Nothing to be done for 'all'.
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make clean
Makefile:3: *** SRC is not set. Usage: make debug SRC=src/yourfile.c or make run SRC=src/yourfile.c.  Stop.
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make clean SRC=src
/c15.c
rm -f bin/* obj/* log/*
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ ./bin/c15 5 4
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ ./bin/c15
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make debug SRC=src
/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
gdb ./bin/c15
GNU gdb (Debian 13.1-3) 13.1
Copyright (C) 2023 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
--Type <RET> for more, q to quit, c to continue without paging--
Type "show copying" and "show warranty" for details.
This GDB was configured as "aarch64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
--Type <RET> for more, q to quit, c to continue without paging--
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./bin/c15...
(gdb) break 12
Breakpoint 1 at 0x774: file src/c15.c, line 14.
(gdb) run
Starting program: /home/dante/UFMG/UFMG-DCC205/ap4 - debug and refactor/bin/c15 
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/aarch64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main (argc=1, argv=0x7fffffee28) at src/c15.c:14
14        if (argc > 1)
(gdb) print argc
$1 = 1
(gdb) Quit
(gdb) q
A debugging session is active.

        Inferior 1 [process 6355] will be killed.

Quit anyway? (y or n) y

dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make debug SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
gdb ./bin/c15
GNU gdb (Debian 13.1-3) 13.1
Copyright (C) 2023 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
--Type <RET> for more, q to quit, c to continue without paging--
Type "show copying" and "show warranty" for details.
This GDB was configured as "aarch64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
--Type <RET> for more, q to quit, c to continue without paging--
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./bin/c15...
(gdb) break 14
Breakpoint 1 at 0x774: file src/c15.c, line 14.
(gdb) run
Starting program: /home/dante/UFMG/UFMG-DCC205/ap4 - debug and refactor/bin/c15 
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/aarch64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main (argc=1, argv=0x7fffffee28) at src/c15.c:14
14        if (argc > 1)
(gdb) print argc
$1 = 1
(gdb) Quit
(gdb) q
A debugging session is active.

        Inferior 1 [process 6621] will be killed.

Quit anyway? (y or n) y

dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
./bin/c15
make: *** [Makefile:40: run] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
./bin/c15
make: *** [Makefile:40: run] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make run SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
./bin/c15
make: *** [Makefile:40: run] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make memtest SRC=s
rc/c15.c
valgrind --leak-check=full ./bin/c15
==7050== Memcheck, a memory error detector
==7050== Copyright (C) 2002-2022, and GNU GPL'd, by Julian Seward et al.
==7050== Using Valgrind-3.19.0 and LibVEX; rerun with -h for copyright info
==7050== Command: ./bin/c15
==7050== 
==7050== 
==7050== HEAP SUMMARY:
==7050==     in use at exit: 0 bytes in 0 blocks
==7050==   total heap usage: 0 allocs, 0 frees, 0 bytes allocated
==7050== 
==7050== All heap blocks were freed -- no leaks are possible
==7050== 
==7050== For lists of detected and suppressed errors, rerun with: -s
==7050== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)
make: *** [Makefile:43: memtest] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make memtest SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
valgrind --leak-check=full ./bin/c15
==7113== Memcheck, a memory error detector
==7113== Copyright (C) 2002-2022, and GNU GPL'd, by Julian Seward et al.
==7113== Using Valgrind-3.19.0 and LibVEX; rerun with -h for copyright info
==7113== Command: ./bin/c15
==7113== 
==7113== 
==7113== HEAP SUMMARY:
==7113==     in use at exit: 0 bytes in 0 blocks
==7113==   total heap usage: 0 allocs, 0 frees, 0 bytes allocated
==7113== 
==7113== All heap blocks were freed -- no leaks are possible
==7113== 
==7113== For lists of detected and suppressed errors, rerun with: -s
==7113== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)
make: *** [Makefile:43: memtest] Error 1
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ make SRC=src/c15.c
gcc -g -Wall -Wextra -Iinclude -c src/c15.c -o obj/c15.o
src/c15.c: In function ‘main’:
src/c15.c:8:27: warning: unused parameter ‘argv’ [-Wunused-parameter]
    8 | int main(int argc, char** argv) {
      |                    ~~~~~~~^~~~
gcc -g -Wall -Wextra -Iinclude -o bin/c15 obj/c15.o
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ ./bin/c15
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ ./bin/c15 4
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ echo ./bin/c15 4
./bin/c15 4
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ echo (./bin/c15 4)
bash: syntax error near unexpected token `./bin/c15'
dante@penguin:~/UFMG/UFMG-DCC205/ap4 - debug and refactor$ exit
exit
Script done.